# Titanic 
### Machine Learning from Disaster

# Actual Prediction with Test Dataset

In [125]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
plt.style.use('fivethirtyeight')


import warnings
warnings.filterwarnings('ignore')
%matplotlib inline

In [126]:
train= pd.read_csv('C:/Users/lovej/Desktop/python/Kaggle/titanic/train.csv')

data= pd.read_csv('C:/Users/lovej/Desktop/python/Kaggle/titanic/test.csv')

In [127]:
print('Oldest Passenger was of:',data['Age'].max(),'Years')
print('Youngest Passenger was of:',data['Age'].min(),'Years')
print('Average Age on the ship:',data['Age'].mean(),'Years')

Oldest Passenger was of: 76.0 Years
Youngest Passenger was of: 0.17 Years
Average Age on the ship: 30.272590361445783 Years

In [128]:
data['Initial']=0
for i in data:
    data['Initial']=data.Name.str.extract('([A-Za-z]+)\.')
    
#let's extract the Salutations(mr, mrs,,,)

train['Initial']=0
for i in train:
    train['Initial']=train.Name.str.extract('([A-Za-z]+)\.')
    
#let's extract the Salutations(mr, mrs,,,)

In [129]:
pd.crosstab(data.Initial,data.Sex).T.style.background_gradient(cmap='summer_r')

# Checking the Initials with Sex

Okay so there are some misspelled Initials like Mlle or Mme that stand for Miss. I will replace them with Miss and same thing for other values.

In [130]:
data['Initial'].replace(['Col','Dona','Dr','Ms','Rev'],
                        ['Other','Mrs','Mr','Miss','Other'],inplace=True)

train['Initial'].replace(['Mlle','Mme','Ms','Dr','Major','Lady',
                        'Countess','Jonkheer','Col','Rev','Capt','Sir',
                        'Don'],['Miss','Miss','Miss','Mr','Mr','Mrs',
                                'Mrs','Other','Other','Other','Mr','Mr','Mr'],inplace=True)

In [131]:
data.groupby('Initial')['Age'].mean()
#Let's check the average age by Initials

Initial
Master     7.406471
Miss      21.774844
Mr        32.114130
Mrs       38.904762
Other     42.750000
Name: Age, dtype: float64

Filling NaN Ages

In [132]:
## Assigning the NaN values with the ceil values of the mean ages
data.loc[(data.Age.isnull())&(data.Initial=='Mr'),'Age']=33
data.loc[(data.Age.isnull())&(data.Initial=='Mrs'),'Age']=39
data.loc[(data.Age.isnull())&(data.Initial=='Master'),'Age']=8
data.loc[(data.Age.isnull())&(data.Initial=='Miss'),'Age']=22
data.loc[(data.Age.isnull())&(data.Initial=='Other'),'Age']=43

## Assigning the NaN values with the ceil values of the mean ages
train.loc[(train.Age.isnull())&(train.Initial=='Mr'),'Age']=33
train.loc[(train.Age.isnull())&(train.Initial=='Mrs'),'Age']=36
train.loc[(train.Age.isnull())&(train.Initial=='Master'),'Age']=5
train.loc[(train.Age.isnull())&(train.Initial=='Miss'),'Age']=22
train.loc[(train.Age.isnull())&(train.Initial=='Other'),'Age']=46

In [133]:
data.Age.isnull().any()
# No null values left finally
train.Age.isnull().any()
# No null values left finally

False

In [134]:
train['Embarked'].fillna('S',inplace=True)

In [135]:
data.Embarked.isnull().any()

False

In [136]:
print('Highest Fare was:',data['Fare'].max())
print('Lowest Fare was:',data['Fare'].min())
print('Average Fare was:',data['Fare'].mean())

Highest Fare was: 512.3292
Lowest Fare was: 0.0
Average Fare was: 35.6271884892086

In [137]:
data.Age.min()

0.17

In [138]:
data['Age_band']=0
data.loc[data['Age']<=15.2,'Age_band']=0
data.loc[(data['Age']>15.2)&(data['Age']<=30.4),'Age_band']=1
data.loc[(data['Age']>30.4)&(data['Age']<=45.6),'Age_band']=2
data.loc[(data['Age']>45.6)&(data['Age']<=60.8),'Age_band']=3
data.loc[data['Age']>60.8,'Age_band']=4
data.head()


train['Age_band']=0
train.loc[train['Age']<=16,'Age_band']=0
train.loc[(train['Age']>16)&(train['Age']<=32),'Age_band']=1
train.loc[(train['Age']>32)&(train['Age']<=48),'Age_band']=2
train.loc[(train['Age']>48)&(train['Age']<=64),'Age_band']=3
train.loc[train['Age']>64,'Age_band']=4
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Initial,Age_band
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs,2
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr,2

In [139]:
data['Age_band'].value_counts().to_frame().style.background_gradient(cmap='summer')
#checking the number of passengers in each band

In [140]:
data['Family_Size']=0
data['Family_Size']=data['Parch']+data['SibSp']
data['Alone']=0
data.loc[data.Family_Size==0,'Alone']=1

train['Family_Size']=0
train['Family_Size']=train['Parch']+train['SibSp']
train['Alone']=0
train.loc[train.Family_Size==0,'Alone']=1

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Initial,Age_band,Family_Size,Alone
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr,1,1,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs,2,1,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss,1,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs,2,1,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr,2,0,1

In [141]:
data['Fare_Range']=pd.qcut(data['Fare'],4)
data.groupby(['Fare_Range'])['Age'].mean().to_frame().style.background_gradient(cmap='summer_r')

In [143]:
data['Fare_cat']=0
data.loc[data['Fare']<=7.896,'Fare_cat']=0
data.loc[(data['Fare']>7.896)&(data['Fare']<=14.454),'Fare_cat']=1
data.loc[(data['Fare']>14.454)&(data['Fare']<=31.5),'Fare_cat']=2
data.loc[(data['Fare']>31.5)&(data['Fare']<=512.329),'Fare_cat']=3

train['Fare_cat']=0
train.loc[train['Fare']<=7.91,'Fare_cat']=0
train.loc[(train['Fare']>7.91)&(train['Fare']<=14.454),'Fare_cat']=1
train.loc[(train['Fare']>14.454)&(train['Fare']<=31),'Fare_cat']=2
train.loc[(train['Fare']>31)&(train['Fare']<=513),'Fare_cat']=3

In [144]:
data['Sex'].replace(['male','female'],[0,1],inplace=True)
data['Embarked'].replace(['S','C','Q'],[0,1,2],inplace=True)
data['Initial'].replace(['Mr','Mrs','Miss','Master','Other'],
                       [0,1,2,3,4],inplace=True)

train['Sex'].replace(['male','female'],[0,1],inplace=True)
train['Embarked'].replace(['S','C','Q'],[0,1,2],inplace=True)
train['Initial'].replace(['Mr','Mrs','Miss','Master','Other'],
                       [0,1,2,3,4],inplace=True)

In [145]:
train['Fare_Range']=pd.qcut(train['Fare'],4)
train.groupby(['Fare_Range'])['Survived'].mean().to_frame().style.background_gradient(cmap='summer_r')

In [146]:
data.drop(['Name','Age','Ticket','Fare','Cabin','Fare_Range'],
         axis=1, inplace=True)
train.drop(['Name','Age','Ticket','Fare','Cabin','Fare_Range'],
         axis=1, inplace=True)

In [147]:
data.head()

,PassengerId,Pclass,Sex,SibSp,Parch,Embarked,Initial,Age_band,Family_Size,Alone,Fare_cat
0,892,3,0,0,0,2,0,2,0,1,0
1,893,3,1,1,0,0,1,3,1,0,0
2,894,2,0,0,0,2,0,4,0,1,1
3,895,3,0,0,0,0,0,1,0,1,1
4,896,3,1,1,1,0,1,1,2,0,1

In [148]:
train.head()

,PassengerId,Survived,Pclass,Sex,SibSp,Parch,Embarked,Initial,Age_band,Family_Size,Alone,Fare_cat
0,1,0,3,0,1,0,0,0,1,1,0,0
1,2,1,1,1,1,0,1,1,2,1,0,3
2,3,1,3,1,0,0,0,2,1,0,1,1
3,4,1,1,1,1,0,0,1,2,1,0,3
4,5,0,3,0,0,0,0,0,2,0,1,1

In [149]:
features=['Pclass','Sex','SibSp','Parch',
          'Embarked','Initial','Age_band',
          'Family_Size','Alone','Fare_cat']
target='Survived'

In [151]:
from sklearn.model_selection import cross_val_predict
from sklearn.model_selection import cross_val_score
from sklearn. ensemble import AdaBoostClassifier

clf=AdaBoostClassifier(n_estimators=200,random_state=0,learning_rate=0.1)
clf.fit(train[features],train[target]) 
pred=clf.predict(data[features])

In [152]:
pred

array([0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1,
       1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1,
       1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       1, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1,
       1, 1, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1,
       0, 0, 1, 1, 0, 1, 1, 1, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1,
       1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1,
       0, 1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0,
       1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1,
       0, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0,
       0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1,
       0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 1, 0, 1, 1, 0,
       0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 0,
       1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0, 1],
      dtype=int64)

In [154]:
submission = pd.DataFrame({'PassengerId':data['PassengerId'], 'Survived': pred})
submission.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [155]:
filename = 'Titanic Predictions 1.csv'

submission.to_csv(filename,index=False)

print('Saved file: ' + filename)

Saved file: Titanic Predictions 1.csv